UDOOboard/arduino-board-package/udoo/solox/boards.txt

udooneo.name=UDOO Neo (Cortex M4)
udooneo.vid.0=0x2341
udooneo.pid.0=0x003d
udooneo.vid.1=0x2A03
udooneo.pid.1=0x003d
udooneo.upload.tool=m4uploader
udooneo.upload.protocol=sam-ba
udooneo.upload.maximum_size=524288
udooneo.upload.use_1200bps_touch=false
udooneo.upload.wait_for_upload_port=false
udooneo.upload.native_usb=false
udooneo.build.mcu=cortex-m4
udooneo.build.f_cpu=227368421L
udooneo.build.usb_product="UDOO Neo"
udooneo.build.board=UDOO_NEO
udooneo.build.core=arduino
udooneo.build.extra_flags=
udooneo.build.ldscript=linker_scripts/gcc/ddr.ld
#udooneo.build.ldscript=linker_scripts/gcc/ram.ld
udooneo.build.variant=udooneo
udooneo.build.variant_system_lib_mqxbsp=mqx/release/bsp/bsp.a
udooneo.build.variant_system_lib_mqxpsp=mqx/release/psp/psp.a
udooneo.build.vid=0x2341
udooneo.build.pid=0x003e
